src/main/test/supply-chain/2-DecideTaxTreatment&Consolidation/0-Apply Tax/1-ConsolidationTreatment/2-TC02.02.03_04_ConsolidationHierarchy_error/2-ST_PTE_TC02.02.03_04_ConsolidationHierarchy_error-1_FixedPrice/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax>
         <arg0>
			         <DocumentId>
				           <SystemSourceId>ICI001</SystemSourceId>
				           <TransactionId/>
			         </DocumentId>
			         <AlternateDocumentId>
				           <CustomField1>TEST</CustomField1>
				           <CustomField2/>
				           <CustomField3/>
				           <CustomField4/>
				           <CustomField5/>
				           <CustomField6/>
				           <CustomField7/>
				           <CustomField8/>
				           <CustomField9/>
				           <CustomField10/>
			         </AlternateDocumentId>
			         <InvoiceLanguage>
				           <LanguageCode/>
				           <LanguageCountryCode/>
			         </InvoiceLanguage>
			         <CommunicationLanguage>
				           <LanguageCode/>
				           <LanguageCountryCode/>
			         </CommunicationLanguage>
			
			         <PriceType>fixed</PriceType>
            <CalculationDecimalPlaces/>
			         <PreviousInvoiceTaxCountry/>
			         <TaxDecisionSet>
				           <TaxDecisionSetId/>
				           <SellerTaxIndicator>
					             <TaxIndicatorAbbreviation/>
					             <TaxIndicatorName/>
					             <TaxIndicatorComment/>
				           </SellerTaxIndicator>
				           <SellerTaxCountry/>
				           <SellerTaxState/>
				           <BuyerTaxIndicator>
					             <TaxIndicatorAbbreviation/>
					             <TaxIndicatorName/>
					             <TaxIndicatorComment/>
				           </BuyerTaxIndicator>
				           <BuyerTaxCountry/>
				           <BuyerTaxState/>
				           <CombinedTaxIndicator/>
				           <CommercialIndicator/>
				           <SellerTaxRegCountry/>
				           <SellerTaxRegState/>
				           <BuyerTaxRegCountry/>
				           <BuyerTaxRegState/>
				           <GrossPriceCountry>CH</GrossPriceCountry>
				           <SellerTaxTotal>
					             <NetAmount/>
					             <TaxAmount/>
					             <GrossAmount/>
					             <TaxAmountInLocalCurrency/>
					             <TaxInvoiceSubTotal>
						               <TaxType>
							                 <TaxTypeName/>
							                 <TaxTypeAbbreviation/>
							                 <TaxTypeDescription/>
						               </TaxType>
						               <TaxCode/>
						               <TaxRate/>
						               <NetAmount/>
						               <TaxAmount/>
						               <GrossAmount/>
						               <TaxAmountInLocalCurrency/>
					             </TaxInvoiceSubTotal>
				           </SellerTaxTotal>
				           <BuyerTaxTotal>
					             <NetAmount/>
					             <TaxAmount/>
					             <GrossAmount/>
					             <TaxAmountInLocalCurrency/>
					             <TaxInvoiceSubTotal>
						               <TaxType>
							                 <TaxTypeName/>
							                 <TaxTypeAbbreviation/>
							                 <TaxTypeDescription/>
						               </TaxType>
						               <TaxCode/>
						               <TaxRate/>
						               <NetAmount/>
						               <TaxAmount/>
						               <GrossAmount/>
						               <TaxAmountInLocalCurrency/>
					             </TaxInvoiceSubTotal>
				           </BuyerTaxTotal>
				           <TaxComment>
					             <TaxCommentType/>
					             <TaxCommentText/>
				           </TaxComment>
				           <InvoiceCurrency>
					             <CurrencyCode>EUR</CurrencyCode>
					             <SellerLocalTaxCurrencyExchangeRate/>
					             <SellerLocalTaxCurrencyCode/>
					             <BuyerLocalTaxCurrencyExchangeRate/>
					             <BuyerLocalTaxCurrencyCode/>
				           </InvoiceCurrency>
				           <LegalTaxCalculationLevel/>
				           <TaxInvoiceLine>
					             <LineNumber>1</LineNumber>
					             <ItemNo>56000000</ItemNo>
					             <ItemType/>
					             <UNSPSC>56000000</UNSPSC>
					             <Classification/>
					             <SubClassification/>
					             <CountryItemClassification/>
					             <NetAmount/>
					             <ItemNetAmount/>
			               <GrossAmount>50.00</GrossAmount>
			               <ItemGrossAmount/>
			               <Quantity/>
		                <SellerTax>
		                   <SellerTaxCountry>
		                      <TaxCalculationLineComponent>
		                         <TaxAmount/>
					                      <ItemTaxAmount/>
		                         <GrossAmount/>
					                      <ItemGrossAmount/>
					                      <NetAmount/>
					                      <ItemNetAmount/>
		                         <TaxAmountInLocalCurrency/>
					                      <ItemTaxAmontInLocalCurrency/>
		                         <TaxCode/>
		                         <TaxType>
		                            <TaxTypeName/>
		                            <TaxTypeAbbreviation/>
		                            <TaxTypeDescription/>
		                         </TaxType>
		                         <TaxRate/>
		                      </TaxCalculationLineComponent>
		                   </SellerTaxCountry>
		                   <SellerTaxState>
		                      <TaxCalculationLineComponent>
		                         <TaxAmount/>
					                      <ItemTaxAmount/>
					                      <GrossAmount/>
					                      <ItemGrossAmount/>
					                      <NetAmount/>
					                      <ItemNetAmount/>
					                      <TaxAmountInLocalCurrency/>
					                      <ItemTaxAmontInLocalCurrency/>
		                         <TaxCode/>
		                         <TaxType>
		                            <TaxTypeName/>
		                            <TaxTypeAbbreviation/>
		                            <TaxTypeDescription/>
		                         </TaxType>
		                         <TaxRate/>
		                      </TaxCalculationLineComponent>
		                   </SellerTaxState>
		                </SellerTax>
			               <BuyerTax>
				                 <BuyerTaxCountry>
					                   <TaxCalculationLineComponent>
						                     <TaxAmount/>
						                     <ItemTaxAmount/>
						                     <GrossAmount/>
						                     <ItemGrossAmount/>
						                     <NetAmount/>
						                     <ItemNetAmount/>
						                     <TaxAmountInLocalCurrency/>
						                     <ItemTaxAmontInLocalCurrency/>
						                     <TaxCode/>
						                     <TaxType>
							                       <TaxTypeName/>
							                       <TaxTypeAbbreviation/>
							                       <TaxTypeDescription/>
						                     </TaxType>
						                     <TaxRate/>
					                   </TaxCalculationLineComponent>
				                 </BuyerTaxCountry>
				                 <BuyerTaxState>
					                   <TaxCalculationLineComponent>
						                     <TaxAmount/>
						                     <ItemTaxAmount/>
						                     <GrossAmount/>
						                     <ItemGrossAmount/>
						                     <NetAmount/>
						                     <ItemNetAmount/>
						                     <TaxAmountInLocalCurrency/>
						                     <ItemTaxAmontInLocalCurrency/>
						                     <TaxCode/>
						                     <TaxType>
							                       <TaxTypeName/>
							                       <TaxTypeAbbreviation/>
							                       <TaxTypeDescription/>
						                     </TaxType>
						                     <TaxRate/>
					                   </TaxCalculationLineComponent>
				                 </BuyerTaxState>
			               </BuyerTax>
					             <VariableTaxSteeringInput>
						               <ConsignorCountry/>
						               <ConsignorState/>
						               <ConsignorBusinessUnitCode>5100</ConsignorBusinessUnitCode>
						               <ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
						               <ConsigneeCountry/>
						               <ConsigneeState/>
						               <ConsigneeBusinessUnitCode>119</ConsigneeBusinessUnitCode>
						               <ConsigneeBusinessUnitType>STO</ConsigneeBusinessUnitType>
						               <CarrierCountry/>
						               <CarrierState/>
						               <CarrierBusinessUnitCode/>
						               <CarrierBusinessUnitType/>
						               <ShipmentStartCountry/>
						               <ShipmentEndCountry/>
						               <ShipmentStartState/>
						               <ShipmentEndState/>
						               <ServiceRenderedCountry/>
						               <ServiceRenderedState/>
						               <ResalePurpose/>
						               <IsOutBonded/>
						               <IsInBonded/>
						               <TaxPreAlgorithmOutput>
							                 <IsExport/>
							                 <IsImport/>
							                 <IsExported/>
							                 <IsImported/>
						               </TaxPreAlgorithmOutput>
						               <ShippingOfCustomsClearedGoods/>
					             </VariableTaxSteeringInput>
				           </TaxInvoiceLine>
					          <SellerTaxInformation>
						            <TaxRegistration>
							              <TaxRegistrationCountry/>
							              <TaxRegistrationNumberType/>
							              <TaxRegistrationNumber/>
							              <TaxRegistrationState/>
							              <TaxRegistrationNumberStateType/>
							              <TaxRegistrationNumberState/>
						            </TaxRegistration>
						            <TaxRepresentative>
							              <TaxParty>
							                 <TaxRepresentativeCode/>
							                 <TaxRepresentativeType/>
							                 <BusinessUnitCode/>
							                 <BusinessUnitType/>
							                 <BusinessUnitName/>
							              </TaxParty>
							              <TaxRegistration>
								                <TaxRegistrationCountry/>
								                <TaxRegistrationNumberType/>
								                <TaxRegistrationNumber/>
								                <TaxRegistrationState/>
								                <TaxRegistrationNumberStateType/>
								                <TaxRegistrationNumberState/>
							              </TaxRegistration>
							              <PartyAddress>
								                <AddressType/>
								                <City/>
								                <PostBox/>
								                <Street/>
								                <ZipCode/>
								                <CountryCode/>
								                <StateCode/>
								                <CountryOfLegalRegistration/>
							              </PartyAddress>
						            </TaxRepresentative>
					          </SellerTaxInformation>
					          <BuyerTaxInformation>
					             <TaxRegistration>
						               <TaxRegistrationCountry/>
						               <TaxRegistrationNumberType/>
						               <TaxRegistrationNumber/>
						               <TaxRegistrationState/>
						               <TaxRegistrationNumberStateType/>
						               <TaxRegistrationNumberState/>
					             </TaxRegistration>
					             <TaxRepresentative>
						               <TaxParty>
						                  <TaxRepresentativeCode/>
						                  <TaxRepresentativeType/>
						                  <BusinessUnitCode/>
						                  <BusinessUnitType/>
						                  <BusinessUnitName/>
						               </TaxParty>
						               <TaxRegistration>
						                  <TaxRegistrationCountry/>
						                  <TaxRegistrationNumberType/>
						                  <TaxRegistrationNumber/>
						                  <TaxRegistrationState/>
						                  <TaxRegistrationNumberStateType/>
						                  <TaxRegistrationNumberState/>
					                </TaxRegistration>
						               <PartyAddress>
						                  <AddressType/>
						                  <City/>
						                  <PostBox/>
						                  <Street/>
						                  <ZipCode/>
						                  <CountryCode/>
						                  <StateCode/>
						                  <CountryOfLegalRegistration/>
						               </PartyAddress>
					             </TaxRepresentative>
					          </BuyerTaxInformation>
			         </TaxDecisionSet>
			         <TaxDate>
				           <TaxAlgorithmDate>2013-10-01</TaxAlgorithmDate>
				           <TaxCalculationDate/>
			         </TaxDate>
			         <TaxModuleBehaviour>
				           <SkipCalculation>N</SkipCalculation>
				           <SkipDecision>N</SkipDecision>
			         </TaxModuleBehaviour>
			         <VariableTaxSteeringInput>
				           <ConsignorCountry/>
				           <ConsignorState/>
				           <ConsignorBusinessUnitCode/>
				           <ConsignorBusinessUnitType/>
				           <ConsigneeCountry/>
				           <ConsigneeState/>
				           <ConsigneeBusinessUnitCode/>
				           <ConsigneeBusinessUnitType/>
				           <CarrierCountry/>
				           <CarrierState/>
				           <CarrierBusinessUnitCode/>
				           <CarrierBusinessUnitType/>
				           <ShipmentStartCountry/>
				           <ShipmentEndCountry/>
				           <ShipmentStartState/>
				           <ShipmentEndState/>
				           <ServiceRenderedCountry/>
				           <ServiceRenderedState/>
				           <ResalePurpose>Y</ResalePurpose>
				           <IsOutBonded>N</IsOutBonded>
				           <IsInBonded>N</IsInBonded>
				           <TaxPreAlgorithmOutput>
					             <IsExport>N</IsExport>
					             <IsImport>Y</IsImport>
					             <IsExported>N</IsExported>
					             <IsImported>Y</IsImported>
				           </TaxPreAlgorithmOutput>
				           <ShippingOfCustomsClearedGoods/>
			         </VariableTaxSteeringInput>
			         <BuyerParty>
				           <Party>
					             <BusinessUnitCode>1206</BusinessUnitCode>
					             <BusinessUnitType>COM</BusinessUnitType>
					             <BusinessUnitName/>
					             <PartyAddress>
						               <AddressType/>
						               <City/>
						               <PostBox/>
						               <Street/>
						               <ZipCode/>
						               <CountryCode>DE</CountryCode>
						               <StateCode/>
						               <CountryOfLegalRegistration/>
					             </PartyAddress>
				           </Party>
				           <CustomerID/>
			         </BuyerParty>
			         <SellerParty>
				           <Party>
					             <BusinessUnitCode>5100</BusinessUnitCode>
					             <BusinessUnitType>COM</BusinessUnitType>
					             <BusinessUnitName/>
					             <PartyAddress>
						               <AddressType/>
						               <City/>
						               <PostBox/>
						               <Street/>
						               <ZipCode/>
						               <CountryCode/>
						               <StateCode/>
						               <CountryOfLegalRegistration/>
					             </PartyAddress>
				           </Party>
			         </SellerParty>
			         <TermOfDelivery/>
         </arg0>
         </ws:applyTax>
   </soap:Body>
</soap:Envelope>